<a id='menu'></a>
 <hr style="width:100%;height:4px;border-width:0;color:gray;background-color:#003d59; opacity:0.25"> 

 ![learning academy and data science campus logos](../images/la_dsc_logo.jpg)
  <hr style="width:100%;height:4px;border-width:0;color:gray;background-color:#003d59; opacity:0.25">

<a id='menu'></a>
# Introduction to Python
## Chapter 6 – Summary Statistics and Aggregation  
***
Follow along with the code by running cells as you encounter them
***
*Chapter Overview/Learning Objectives*

* [Packages and Data](#packages)
 * Packages
 * Data
 
 
* [Overall Descriptive Statistics](#describe)


* [Range](#range)
 * min
 * max
 * quantiles
 

* [Averages](#averages)
 * Mean
 * Median
 * Mode
 
 
* [Spread](#spread)
 * Standard Deviation
 * Variance
 

* [Counting Values](#count)
 * Counts
 * Null Value counts
 * Value Counts


* [Other Summary Statistics](#other)


* [Creating Size Bands](#cut)


* [Aggregation](#agg)

<a id='packages'></a>
<hr style="width:100%;height:4px;border-width:0;color:gray;background-color:#003d59; opacity:1">

## Packages and Data

### Packages

As a reminder – we should always import our packages at the top of our script.


In this session we will use:

* `pandas`, and give it the nickname `pd`
* `numpy` and give it the nickname `np`

Complete this action in the cell below.

In [ ]:
# Import pandas and numpy into this cell

You can run the "solution" cell if you need help - or revisit Chapter 2.

Practicing these basic commands helps your retention of the skills.

In [2]:
# %load ../solutions/chapter_6/chaptersixpackages.py
import pandas as pd
import numpy as np

We’ll now import the data again.

In this session we will use:

| variable name | file name  |
| ------- | --- |
| animals | animals.csv |
| titanic | titanic.xlsx |

In [ ]:
# Import the animals and the titanic data into this cell

In [4]:
# %load ../solutions/chapter_6/chaptersixdata.py
animals = pd.read_csv("../data/animals.csv")
titanic = pd.read_excel("../data/titanic.xlsx")

You can check your variables are loaded by using `%whos` in Jupyter. In Spyder or other IDE's they should appear in your variable explorer. 

If you struggle with this section – review Chapter 3.

In [5]:
%whos

Variable   Type         Data/Info
---------------------------------
animals    DataFrame           IncidentNumber    <...>n[5752 rows x 19 columns]
np         module       <module 'numpy' from 'C:\<...>ges\\numpy\\__init__.py'>
pd         module       <module 'pandas' from 'C:<...>es\\pandas\\__init__.py'>
titanic    DataFrame          pclass  survived   <...>n[1309 rows x 14 columns]

[return to menu](#menu)

<a id='describe'></a>
<hr style="width:100%;height:4px;border-width:0;color:gray;background-color:#003d59; opacity:1">

## Overall Descriptive Statistics

Pandas has an inbuilt method to get basic descriptive statistics, this is `.describe()`

In [6]:
titanic.describe()

,pclass,survived,age,sibsp,parch,fare,body
count,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000,121.000000
mean,2.294882,0.381971,29.881135,0.498854,0.385027,33.295479,160.809917
std,0.837836,0.486055,14.413500,1.041658,0.865560,51.758668,97.696922
min,1.000000,0.000000,0.166700,0.000000,0.000000,0.000000,1.000000
25%,2.000000,0.000000,21.000000,0.000000,0.000000,7.895800,72.000000
50%,3.000000,0.000000,28.000000,0.000000,0.000000,14.454200,155.000000
75%,3.000000,1.000000,39.000000,1.000000,0.000000,31.275000,256.000000
max,3.000000,1.000000,80.000000,8.000000,9.000000,512.329200,328.000000

Describe works on numeric columns by default. We can also get summary statistics on a specific column.

In [7]:
titanic["fare"].describe()

count    1308.000000
mean       33.295479
std        51.758668
min         0.000000
25%         7.895800
50%        14.454200
75%        31.275000
max       512.329200
Name: fare, dtype: float64

These statistics are explained in more detail below:
 
| Summary Statistic | Description|
|--------------------------|-----------------|
| count | the number (count) of non missing entries in the given column.
| mean | the average (arithmetic mean) data value in the given column.
| std | the standard deviation (spread) of values in the given column.
| min |  the smallest value in the given column.
| 25% | the value of the data at the lower quartile <br> (i.e. after the first 25% of data, ordered from smallest to largest).
| 50% | the middle value of the data (aka the median). <br> half the values are larger than this value, and half smaller.
| 75% | the value of the data at the upper quartile <br> (i.e. after the first 75% of data, ordered from smallest to largest).
| max | the maximum data value recorded.

We can display descriptive information for other data types by using the parameter `include= ` . 

This parameter takes a list as the input; even if we’re just including one kind of data. 

Here we’re specifying that we want to include “object” – our object columns.

In [8]:
titanic.describe(include=["object"])

,name,sex,ticket,cabin,embarked,home.dest,boat
count,1309,1309,1309,295,1307,745,486
unique,1307,2,929,186,3,369,28
top,"Connolly, Miss. Kate",male,CA. 2343,C23 C25 C27,S,"New York, NY",13
freq,2,843,11,6,914,64,39

| Summary Statistic | Description|
|--------------------------|-----------------|
| count | The number (count) of non missing entries in the given column.
| unique | The number of unique variables in a column.
| top | The most frequently occurring value.
| freq | The frequency of the “top” value.

If there are two or more “top” values; e.g. both most frequently occurring values that have the same frequency within the table then Python will [kind of arbitrarily](https://github.com/pandas-dev/pandas/issues/15833) choose one of them to be the top value. The link is added for general interest, you don't need to understand it.

In this data there are two women and two men who share the same name. Pandas will choose one of them to display.

`titanic.describe(include=[np.number])` will return you all numeric columns, in the same way as `titanic.describe(include=["int64", "float64"])`

In [10]:
titanic.describe(include= "all")

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,home.dest,body,boat
count,1309.000000,1309.000000,1309,1309,1046.000000,1309.000000,1309.000000,1309,1308.000000,295,1307,745,121.000000,486
unique,NaN,NaN,1307,2,NaN,NaN,NaN,929,NaN,186,3,369,NaN,28
top,NaN,NaN,"Connolly, Miss. Kate",male,NaN,NaN,NaN,CA. 2343,NaN,C23 C25 C27,S,"New York, NY",NaN,13
freq,NaN,NaN,2,843,NaN,NaN,NaN,11,NaN,6,914,64,NaN,39
mean,2.294882,0.381971,NaN,NaN,29.881135,0.498854,0.385027,NaN,33.295479,NaN,NaN,NaN,160.809917,NaN
std,0.837836,0.486055,NaN,NaN,14.413500,1.041658,0.865560,NaN,51.758668,NaN,NaN,NaN,97.696922,NaN
min,1.000000,0.000000,NaN,NaN,0.166700,0.000000,0.000000,NaN,0.000000,NaN,NaN,NaN,1.000000,NaN
25%,2.000000,0.000000,NaN,NaN,21.000000,0.000000,0.000000,NaN,7.895800,NaN,NaN,NaN,72.000000,NaN
50%,3.000000,0.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN,NaN,155.000000,NaN
75%,3.000000,1.000000,NaN,NaN,39.000000,1.000000,0.000000,NaN,31.275000,NaN,NaN,NaN,256.000000,NaN
max,3.000000,1.000000,NaN,NaN,80.000000,8.000000,9.000000,NaN,512.329200,NaN,NaN,NaN,328.000000,NaN

[return to menu](#menu)

<a id='range'></a>
<hr style="width:100%;height:4px;border-width:0;color:gray;background-color:#003d59; opacity:1">

## Range

We can also access these summary statistics individually. In most cases the name of the method is the same as the summary statistic.

<hr style="width:70%;height:4px;border-width:0;color:gray;background-color:#003d59; opacity:0.75">

### min

We can use `.min()` to return the minimum value in a column.

In [11]:
titanic["fare"].min()

0.0

This also works for object (text) columns.

In [12]:
titanic["name"].min()

'Abbing, Mr. Anthony'

<hr style="width:70%;height:4px;border-width:0;color:gray;background-color:#003d59; opacity:0.75">

### max

We can use `.max()` to return the maximum value in a column.

In [13]:
titanic["fare"].max()

512.32920000000001

This also works for object (text) columns.

In [14]:
titanic["name"].max()

'van Melkebeke, Mr. Philemon'

Something important to note here is that `pandas` effectively assigns a value to each letter. 

This goes A-Z and **then** a-z.

A lower case "a" is treated as coming **after** a capital "Z" in Python.

This is why van Melkebeke, Mr. Philemon is the maximum value in our `Titanic` Dataframe rather than Zimmerman, Mr Leo.

We can handle this by ensuring our data is either all lower case or all upper case before finding the `.min()` or `.max()` values. Here I’ve done this by chaining the methods `.str.lower()` and `.max()` together.

If I wanted to do more work with this column in future I may consider overwriting it with a lower case version.

In [16]:
titanic["name"].str.title().max()

'Zimmerman, Mr. Leo'

<hr style="width:70%;height:4px;border-width:0;color:gray;background-color:#003d59; opacity:0.75">

### Quantiles

We can use `.quantile()` to find information at different points of our data.

Our parameter is `q= ` and then a decimal number.

If we don't specify this the default behaviour is `0.5`.

In [17]:
titanic["fare"].quantile(q=0.25)

7.8958

If we wish to specify more than one, we pass a list to the parameter `q= `

In [18]:
titanic["fare"].quantile(q=[0, 0.25, 0.5, 0.75, 1])

0.00      0.0000
0.25      7.8958
0.50     14.4542
0.75     31.2750
1.00    512.3292
Name: fare, dtype: float64

We can also use the `np.arange()` function from the `numpy` package (`np`) here rather than manually specifying as a list. This creates *a* range (not arranging the data). Note the `range()` function only works with integers; or whole numbers, while `np.arange()` allows us to work with floats; or decimal numbers.

Like in `range()` in `np.arange()` the stop number is exclusive.

In [20]:
# Note that .arange() comes from the numpy package (np)


titanic["fare"].quantile(q=np.arange(start=0.0, 
                                     stop=1.01,  # Remember this is exclusive!
                                     step=0.01))

0.00      0.000000
0.01      0.000000
0.02      6.495800
0.03      7.050000
0.04      7.129676
0.05      7.225000
0.06      7.229200
0.07      7.229200
0.08      7.250000
0.09      7.301696
0.10      7.567500
0.11      7.728234
0.12      7.750000
0.13      7.750000
0.14      7.750000
0.15      7.750000
0.16      7.753000
0.17      7.775000
0.18      7.776092
0.19      7.806864
0.20      7.854200
0.21      7.863976
0.22      7.891982
0.23      7.895800
0.24      7.895800
0.25      7.895800
0.26      7.925000
0.27      7.925000
0.28      8.050000
0.29      8.050000
           ...
0.71     27.720800
0.72     28.501500
0.73     29.700000
0.74     30.500000
0.75     31.275000
0.76     31.500000
0.77     34.375000
0.78     36.750000
0.79     39.400000
0.80     41.579200
0.81     46.900000
0.82     51.762842
0.83     52.554200
0.84     55.441700
0.85     56.929200
0.86     61.175000
0.87     66.600000
0.88     69.550000
0.89     75.241700
0.90     78.050820
0.91     79.650000
0.92     83.158300
0.93     90.000000
0.94    108.900000
0.95    133.650000
0.96    146.520800
0.97    164.866700
0.98    221.779200
0.99    262.375000
1.00    512.329200
Name: fare, Length: 101, dtype: float64

<hr style="width:50%;height:4px;border-width:0;color:gray;background-color:#003d59; opacity:0.5">

## Exercise 1

How old is the oldest passenger in the DataFrame

In [30]:
# Exercise

titanic[titanic["survived"] == 0]

pclass                        1
survived                      0
name        Abbing, Mr. Anthony
sex                      female
age                      0.3333
sibsp                         0
parch                         0
fare                          0
embarked                      C
body                          1
dtype: object

In [27]:
titanic[(titanic["age"] == titanic["age"].min() )]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,home.dest,body,boat
763,3,1,"Dean, Miss. Elizabeth Gladys ""Millvina""",female,0.1667,1,2,C.A. 2315,20.575,NaN,S,"Devon, England Wichita, KS",NaN,10

In [ ]:
# Solution - These cells contain answers for the exercises.
# Run once to reveal the code
# Run again to reveal the output

%load ../solutions/chapter_6/oldest_passenger.py

[return to menu](#menu)

<a id='averages'></a>
<hr style="width:100%;height:4px;border-width:0;color:gray;background-color:#003d59; opacity:1">

## Averages

### Mean

`.mean()` finds us the sum of the column, divided by the number of items in the column.

In [31]:
titanic["fare"].mean()

33.29547928134572

<hr style="width:70%;height:4px;border-width:0;color:gray;background-color:#003d59; opacity:0.75">

### Median

The `.median()` is the middle value when the numbers are listed in order.

In [32]:
titanic["fare"].median()

14.4542

<hr style="width:70%;height:4px;border-width:0;color:gray;background-color:#003d59; opacity:0.75">

### Mode

The `.mode()` is the value that occurs most frequently in the column.

In [33]:
titanic["fare"].mode()

0    8.05
dtype: float64

`.mode()` can also be calculated for object based columns.

Here the `name` column has two modes; both `Connolly, Miss. Kate` and `Kelly, Mr. James` appear twice in the Data Frame.

How do we know they appear twice? We’ll look at the function to find this  `.value_counts()` later in this section.

In [34]:
titanic["name"].mode()

0    Connolly, Miss. Kate
1        Kelly, Mr. James
dtype: object

Interestingly this data isn’t duplicates, There really were two separate individuals with those names!

In [35]:
titanic[(titanic["name"] == "Connolly, Miss. Kate") | (titanic["name"] == "Kelly, Mr. James")]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,home.dest,body,boat
725,3,1,"Connolly, Miss. Kate",female,22.0,0,0,370373,7.7500,NaN,Q,Ireland,NaN,13
726,3,0,"Connolly, Miss. Kate",female,30.0,0,0,330972,7.6292,NaN,Q,Ireland,NaN,NaN
924,3,0,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,NaN,70.0,NaN
925,3,0,"Kelly, Mr. James",male,44.0,0,0,363592,8.0500,NaN,S,NaN,NaN,NaN

[return to menu](#menu)

<a id='spread'></a>
<hr style="width:100%;height:4px;border-width:0;color:gray;background-color:#003d59; opacity:1">

## Spread

### Standard Deviation

The standard deviation measures the spread of the data about the mean value. It shows you how much your data distribution is spread out around the mean or average.

We can calculate the standard deviation using the `.std()` method.

In [36]:
titanic["fare"].std()

51.758668239174135

<hr style="width:70%;height:4px;border-width:0;color:gray;background-color:#003d59; opacity:0.75">

### Variance

Variance measures how spread the values of a variable are.
We can calculate the variance using the `.var()` method.

In [37]:
titanic["fare"].var()

2678.9597378928934

<hr style="width:50%;height:4px;border-width:0;color:gray;background-color:#003d59; opacity:0.5">

## Exercise

Find the standard deviation of the `age` column

In [39]:
# Exercise

titanic_age_std = titanic["age"].std()
titanic_age_std

14.413499699923594

In [42]:
t_d = titanic.describe()
t_d.to_csv("file.csv")

In [ ]:
# Solution - These cells contain answers for the exercises.
# Run once to reveal the code
# Run again to reveal the output

%load ../solutions/chapter_6/standard_deviation.py

[return to menu](#menu)

<a id='count'></a>
<hr style="width:100%;height:4px;border-width:0;color:gray;background-color:#003d59; opacity:1">

## Counting Values

### Counts

We can find the number of non null values in a column using the `.count()` method. 

By non null values we mean values with data in them - not the missing values.

In [43]:
titanic["sex"].count()

1309

<hr style="width:70%;height:4px;border-width:0;color:gray;background-color:#003d59; opacity:0.75">

### Null Value counts

We can find how many null values we have by using the `.isnull()` method. 

`.isnull()` returns a Boolean series – of `True` and `False` values.

In [45]:
titanic["age"].isnull().tail()

1304    False
1305     True
1306    False
1307    False
1308    False
Name: age, dtype: bool

As these have numeric values behind them (`True` is 1, `False` is 0 ) we can use `.sum()` to total them.

In [46]:
titanic["age"].isnull().sum()

263

In [47]:
titanic["age"].count()

1046

In [48]:
len(titanic)

1309

In more modern versions of Pandas the method `.isna()` also exists and provides the same output.

<hr style="width:70%;height:4px;border-width:0;color:gray;background-color:#003d59; opacity:0.75">

### Value Counts

We can find the frequencies of each unique value in a column, by using `.value_counts()`.

In [53]:
titanic["sex"].value_counts(sort = False)

female    466
male      843
Name: sex, dtype: int64

<hr style="width:50%;height:4px;border-width:0;color:gray;background-color:#003d59; opacity:0.5">

## Exercise 1

How many passengers were in each class?

In [56]:
# Exercise
titanic["pclass"].value_counts(sort = False, normalize = True)

1    0.246753
2    0.211612
3    0.541635
Name: pclass, dtype: float64

In [51]:
help(pd.value_counts)

Help on function value_counts in module pandas.core.algorithms:

value_counts(values, sort=True, ascending=False, normalize=False, bins=None, dropna=True)
    Compute a histogram of the counts of non-null values.

    Parameters
    ----------
    values : ndarray (1-d)
    sort : boolean, default True
        Sort by values
    ascending : boolean, default False
        Sort in ascending order
    normalize: boolean, default False
        If True then compute a relative histogram
    bins : integer, optional
        Rather than count values, group them into half-open bins,
        convenience for pd.cut, only works with numeric data
    dropna : boolean, default True
        Don't include counts of NaN

    Returns
    -------
    value_counts : Series

In [ ]:
# Solution - These cells contain answers for the exercises.
#Run once to reveal the code.
#Run again to reveal the output. 

%load ../solutions/chapter_6/how_many_pclass.py

<hr style="width:50%;height:4px;border-width:0;color:gray;background-color:#003d59; opacity:0.5">

## Exercise 2

Look in the help for `pd.Series.value_counts()` to see how you can return the values as a proportion

In [ ]:
# Exercise

In [ ]:
# Solution - These cells contain answers for the exercises.
#Run once to reveal the code.
#Run again to reveal the output. 

%load ../solutions/chapter_6/pclass_proportion.py

[return to menu](#menu)

<a id='other'></a>
<hr style="width:100%;height:4px;border-width:0;color:gray;background-color:#003d59; opacity:1">

## Other Aggregation Statistics

### Sum

We can use `.sum()` to add up columns of numeric data.

In [57]:
titanic["fare"].sum()

43550.4869000002

The `.sum()` method comes from Pandas; there is also an inbuilt function `sum()`. However if we have null values in the column this will return us `nan`.

In [58]:
sum(titanic["fare"])

nan

If we have null values using the `.sum()` Panda’s method handles the null values for us.

<hr style="width:70%;height:4px;border-width:0;color:gray;background-color:#003d59; opacity:0.75">

### Unique

We can use `.unique()` to find values that are unique in a column. This is returned as an array.

In [59]:
titanic["boat"].unique()

array([2, '11', nan, '3', '10', 'D', '4', '9', '6', 'B', '8', 'A', '5',
       '7', 'C', '14', '2', '5 9', '13', '1', '15', '5 7', '8 10', '12',
       '16', '13 15 B', 'C D', '15 16', '13 15'], dtype=object)

<hr style="width:70%;height:4px;border-width:0;color:gray;background-color:#003d59; opacity:0.75">

### Nunique

`.nunique()` can be used to find the number of unique values in a column.

In [60]:
titanic["boat"].nunique()

28

[return to menu](#menu)

<a id='cut'></a>
<hr style="width:100%;height:4px;border-width:0;color:gray;background-color:#003d59; opacity:1">

## Creating Size Bands

## pd.cut()

We can use the method `pd.cut()` to cut or “bin” our data into groups or categories. This is commonly done when creating size bands; like age bands.

`pd.cut()` takes a column of data and groups it into “bins” or categories. This column will have the data type of “category”. There’s some more information about the “category” data type [in this link]( https://pbpython.com/pandas_dtypes_cat.html).

We often assign the output of `pd.cut()` to a new column. This is because we don’t want to overwrite and change the data type of the existing column.

In [61]:
titanic["binned_ages"] = pd.cut(titanic["age"],
                                bins=10)

titanic.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,home.dest,body,boat,binned_ages
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,"St Louis, MO",NaN,2,"(24.117, 32.1]"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,"Montreal, PQ / Chesterville, ON",NaN,11,"(0.0869, 8.15]"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,"Montreal, PQ / Chesterville, ON",NaN,NaN,"(0.0869, 8.15]"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,"Montreal, PQ / Chesterville, ON",135.0,NaN,"(24.117, 32.1]"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,"Montreal, PQ / Chesterville, ON",NaN,NaN,"(24.117, 32.1]"

We set the parameter bins = to specify the number of categories that we want.

By passing an integer to this, Pandas takes the smallest value and the largest value in the column and creates the number of categories defined.

We can look at our bins. Note the ( denotes exclusion of that number and the ] denotes inclusion of that number.

Now these are `categories` we can see there is a relationship between each category.

In [62]:
titanic["binned_ages"].unique()

[(24.117, 32.1], (0.0869, 8.15], (40.083, 48.067], (56.05, 64.033], (32.1, 40.083], ..., (64.033, 72.017], (16.133, 24.117], (72.017, 80.0], NaN, (8.15, 16.133]]
Length: 11
Categories (10, interval[float64]): [(0.0869, 8.15] < (8.15, 16.133] < (16.133, 24.117] < (24.117, 32.1] ... (48.067, 56.05] < (56.05, 64.033] < (64.033, 72.017] < (72.017, 80.0]]

We can also pass our own values to determine where the edges of the categories are.

This could be as a list of values or here I create a range.

Note that here I am having to use the `numpy` method  `np.arange()` as this number contains decimals.

In [63]:
titanic["binned_ages2"]  = pd.cut(titanic["age"],  # Data to cut
                                  bins=np.arange(start=0,
                                                 stop=(titanic["age"].max() + 1) , # Remember stop is exclusive!
                                                 step=10))

titanic.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,home.dest,body,boat,binned_ages,binned_ages2
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,"St Louis, MO",NaN,2,"(24.117, 32.1]","(20.0, 30.0]"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,"Montreal, PQ / Chesterville, ON",NaN,11,"(0.0869, 8.15]","(0.0, 10.0]"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,"Montreal, PQ / Chesterville, ON",NaN,NaN,"(0.0869, 8.15]","(0.0, 10.0]"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,"Montreal, PQ / Chesterville, ON",135.0,NaN,"(24.117, 32.1]","(20.0, 30.0]"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,"Montreal, PQ / Chesterville, ON",NaN,NaN,"(24.117, 32.1]","(20.0, 30.0]"

Here we’re combining the `.max()` method with the `np.arange()` method within the `pd.cut()` method. 

This means I don’t have to know the maximum value for the column before I write this piece of code. You can see how we can combine methods quite easily to make our life easier.


It is important to note that in this part of the code :

`stop=(titanic["age"].max() + 1)` 

I use brackets to enforce the order of operations. If I didn’t add 1 to the stop, the entry at my maximum value would read `NaN`.

We can also add labels to our categories. This time rather than displaying the bin edges it will display the text strings we specify.

This is passed as a list to the parameter `labels=` .

In [65]:
titanic["binned_ages3"] = pd.cut(titanic["age"],  # Data to cut
                                 bins=np.arange(start=0,
                                                stop=(titanic["age"].max() + 1),
                                                step=10),
                                 labels=["Age: 0 – 10", "Age: 10.00000000001-20", " 21 – 30",
                                         "31 – 40", "41 – 50", "51 – 60",
                                         "61 – 70", "71 - 80"])

titanic.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,home.dest,body,boat,binned_ages,binned_ages2,binned_ages3
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,"St Louis, MO",NaN,2,"(24.117, 32.1]","(20.0, 30.0]",21 – 30
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,"Montreal, PQ / Chesterville, ON",NaN,11,"(0.0869, 8.15]","(0.0, 10.0]",Age: 0 – 10
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,"Montreal, PQ / Chesterville, ON",NaN,NaN,"(0.0869, 8.15]","(0.0, 10.0]",Age: 0 – 10
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,"Montreal, PQ / Chesterville, ON",135.0,NaN,"(24.117, 32.1]","(20.0, 30.0]",21 – 30
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,"Montreal, PQ / Chesterville, ON",NaN,NaN,"(24.117, 32.1]","(20.0, 30.0]",21 – 30

Note these bands are approximate, e.g someone with an age of 20.2 will go into the band labelled `21-30`. Integers were chosen as it's an easier read, and most ages after 1 are whole numbers. 

There’s additional parameters we can set here; check the help function if there’s anything specific you need to do.

<hr style="width:70%;height:4px;border-width:0;color:gray;background-color:#003d59; opacity:0.75">

## pd.qcut()

`pd.qcut()` is described in the documentation as a “Quantile-based discretization function”. This means that `pd.qcut()` tries to divide the data into bins of equal sizes, rather than using the numeric edges of the data to create the bins.

In the cell below I’m using `pd.qcut()` to cut the `age` column in to 10. This using the same data and the same number of segments as the `pd.cut()` we did at the start.

In [66]:
# Divide fare into 3 equally sized classes.
titanic["age_qcut"] = pd.qcut(titanic["age"],
                              q=10)  # Note the parameter here is q

#View the data
titanic.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,home.dest,body,boat,binned_ages,binned_ages2,binned_ages3,age_qcut
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,"St Louis, MO",NaN,2,"(24.117, 32.1]","(20.0, 30.0]",21 – 30,"(28.0, 31.0]"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,"Montreal, PQ / Chesterville, ON",NaN,11,"(0.0869, 8.15]","(0.0, 10.0]",Age: 0 – 10,"(0.166, 14.0]"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,"Montreal, PQ / Chesterville, ON",NaN,NaN,"(0.0869, 8.15]","(0.0, 10.0]",Age: 0 – 10,"(0.166, 14.0]"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,"Montreal, PQ / Chesterville, ON",135.0,NaN,"(24.117, 32.1]","(20.0, 30.0]",21 – 30,"(28.0, 31.0]"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,"Montreal, PQ / Chesterville, ON",NaN,NaN,"(24.117, 32.1]","(20.0, 30.0]",21 – 30,"(22.0, 25.0]"

We can really see the difference between the two new "cut" columns if we visualise them.

Here I've taken a `pd.cut()` and a `pd.qcut()` and set `bins/q = 10`.

The `pd.cut()` action on the left, cuts the range of the data into 10 bins. You can see the data is not distributed evenly between these 10 bins, but the bins are of equal size.

The `pd.qcut()` action on the right cuts the data so each of the 10 bins has roughly an equal number in each bin (edge cases in this case have made it slightly more uneven as we cannot split identical values between bins!). You can see the size of bins is not uniform, unlike the `pd.cut()` bins.


![A comparison of cut and qcut](../images/comparing_cut_and_qcut.svg)

In [ ]:
# The code used to create this figures can be loaded in this cell.
# Note this used a package called Matplotlib.pyplot - one of many options for visualising your data. 
# Learning Visualisation is out of the scope of this course

%load ../solutions/chapter_6/pdcutvisualisationcode.py

[return to menu](#menu)

<a id='agg'></a>
<hr style="width:100%;height:4px;border-width:0;color:gray;background-color:#003d59; opacity:1">

## Aggregation

Aggregation means grouping data together by a particular grouping variable and producing a summary of one or more columns for that grouping variable.

I want to find out if the average fare paid is different for each passenger class.

We have 3 passenger classes; 1st, 2nd and 3rd.

We can check that using the `.unique()` function as we saw earlier.

In [71]:
titanic["pclass"].unique()

array([1, 2, 3], dtype=int64)

We'll use the .groupby() method in this tutorial. Panda's also provides us with the pd.crosstab() and the pd.pivot_table() methods as well. You can find these in the additional materials chapter.

This function can be really useful, especially when your data are disaggregate  - e.g. data about individual units of people or things.

.groupby() allows us to aggregate by a categorical variable and summarise numerical data into a new DataFrame.

.groupby() works on a principle known as 'split-apply-combine':

![image showing the stages of a group by](../images/group_by.JPG)

Split - a DataFrame is divided into a set of smaller DataFrames based on the grouping variable. 

Apply - an aggregation is applied to each of the groups to create a single row for each group in the original DataFrame. 

Combine - bring together the aggregated DataFrame rows into a final new DataFrame.

In [72]:
titanic_class_fare = titanic.groupby(by="pclass")["fare"].mean() 

titanic_class_fare

pclass
1    87.508992
2    21.179196
3    13.302889
Name: fare, dtype: float64

I want to find if the `.mean()` value of the `Fare` was different depending where someone embarked.

In the `.groupby()` method to the `by= ` parameter I pass the column I wish to group by.

The column `pclass` has three values – "1" , "2" and "3".

The `.groupby()` behaviour will effectively split the original DataFrame `titanic` into three new DataFrames. One with the values of `1`, one for "2" and one with the values of `3`. This is the **split** step.

From these new `.groupby()` DataFrames I select the column `["fare"]` and apply the summary statistic `.mean()` to it. This is the **apply** step.

This is returned in the DataFrame “titanic_class_fare”, this is the **combine** step.

We can also use more complicates groupings - here grouping first by `pclass` then `embarked`.

In [73]:
titanic.groupby(by=["pclass", "embarked"])["fare"].mean()

pclass  embarked
1       C           106.845330
        Q            90.000000
        S            72.148094
2       C            23.300593
        Q            11.735114
        S            21.206921
3       C            11.021624
        Q            10.390820
        S            14.435422
Name: fare, dtype: float64

The order we pass these columns affects our output.

Note here with `embarked` and `pclass` reversed the resultant DataFrame is different.

In [74]:
titanic.groupby(by=["embarked", "pclass"])["fare"].mean()

embarked  pclass
C         1         106.845330
          2          23.300593
          3          11.021624
Q         1          90.000000
          2          11.735114
          3          10.390820
S         1          72.148094
          2          21.206921
          3          14.435422
Name: fare, dtype: float64

You can also use other summary statistics here – including `.count()` to return the number of values.


Here 141 passengers were embarked in Cherbourg and were pclass 1.

In [75]:
titanic.groupby(by=["embarked", "pclass"])["fare"].count()

embarked  pclass
C         1         141
          2          28
          3         101
Q         1           3
          2           7
          3         113
S         1         177
          2         242
          3         494
Name: fare, dtype: int64

[return to menu](#menu)

<hr style="width:50%;height:4px;border-width:0;color:gray;background-color:#003d59; opacity:0.5">

## Exercise 1

Group `animals` by the column `AnimalClass` and find the `.sum()` of the `IncidentNominalCost(£)` column.

In [ ]:
# Exercise

In [77]:
# %load ../solutions/chapter_6/animalclass_gb_incident_nominal.py
animalclass_sum = animals.groupby(by="AnimalClass")['IncidentNominalCost(£)'].sum()

animalclass_sum

AnimalClass
Bird        350487.0
Fish          1560.0
Mammal     1597513.0
Reptile       3730.0
Name: IncidentNominalCost(£), dtype: float64

<hr style="width:50%;height:4px;border-width:0;color:gray;background-color:#003d59; opacity:0.5">

## Exercise 2

Group `animals` by the column `Borough` and `AnimalClass` and find the `.mean()` of the `PumpHoursTotal` column.

In [ ]:
# Exercise

In [79]:
# %load ../solutions/chapter_6/animalclass_groupby.py
pump_hours_mean = animals.groupby(by=["Borough", "AnimalClass"])['PumpHoursTotal'].mean()

pump_hours_mean.head()

Borough               AnimalClass
Barking And Dagenham  Bird           1.035714
                      Mammal         1.141667
Barnet                Bird           1.066667
                      Mammal         1.164021
                      Reptile        1.000000
Name: PumpHoursTotal, dtype: float64

In [80]:
# %load ../solutions/chapter_6/animalclass_groupby.py
pump_hours_mean = animals.groupby(by=["AnimalClass", "Borough", ])['PumpHoursTotal'].mean()

pump_hours_mean.head()

AnimalClass  Borough
Bird         Barking And Dagenham    1.035714
             Barnet                  1.066667
             Bexley                  1.058824
             Brent                   1.131579
             Bromley                 1.200000
Name: PumpHoursTotal, dtype: float64

<hr style="width:50%;height:4px;border-width:0;color:gray;background-color:#003d59; opacity:0.5">

If we want to do return more than one aggregation there is the `.agg()` method.

This takes a dictionary where the key is our column and the value is the aggregation method we wish to apply as a string.

These aggfuncs are slightly different to what we’ve seen, but are straightforward like “sum”, ”count”, ”mean” etc.

In [81]:
animalclass_sum = animals.groupby(by="AnimalClass").agg({"IncidentNominalCost(£)": "sum",
                                                         "PumpHoursTotal": "mean"})

animalclass_sum

             IncidentNominalCost(£)  PumpHoursTotal
AnimalClass
Bird                       350487.0        1.106912
Fish                         1560.0        3.000000
Mammal                    1597513.0        1.203162
Reptile                      3730.0        1.083333

If we want to apply more than one aggregation to a column we can pass a list to the values of the dictionary.

This requires us to use the numpy methods – so `np.sum` , `np.mean` etc.

In [82]:
animalclass_sum = animals.groupby(by="AnimalClass").agg({"IncidentNominalCost(£)": [np.sum, np.mean],
                                                         "PumpHoursTotal": "mean"})

animalclass_sum

            IncidentNominalCost(£)             PumpHoursTotal
                               sum        mean           mean
AnimalClass
Bird                      350487.0  323.029493       1.106912
Fish                        1560.0  780.000000       3.000000
Mammal                   1597513.0  346.006714       1.203162
Reptile                     3730.0  310.833333       1.083333

In later versions of Pandas (from 0.25.0) named aggregation also exists. [The help guide can be found here]( https://pandas-docs.github.io/pandas-docs-travis/user_guide/groupby.html#named-aggregation)

Note that these DataFrames look a little different to the ones we’ve seen so far. The index is our grouping categories.

We can use the parameter `as_index = False` to reset it - or we could do a `.reset_index()` method we have seen previously. There are a few reasons we might do this, including visualisation.

In [83]:
group_by_dropped_index = titanic.groupby(by=["embarked", "pclass"], as_index = False)["fare"].count()

group_by_dropped_index

  embarked  pclass  fare
0        C       1   141
1        C       2    28
2        C       3   101
3        Q       1     3
4        Q       2     7
5        Q       3   113
6        S       1   177
7        S       2   242
8        S       3   494

<a id='END'></a>
<hr style="width:100%;height:4px;border-width:0;color:gray;background-color:#003d59; opacity:1">

## End of Chapter

In this chapter we’ve explored:
* Overall descriptive statistics
* Range
* Averages
* Spread
* Counting Values
* Other general summary statistics
* Size Bands
* Aggregation.


You have completed chapter 6 of the Introduction to Python course. Please move on to chapter 7.

[return to menu](#menu)